class Translation(object):
    START_TEXT = """🌀خوش آمدید
🔰برای استفاده از ربات کافی است
لینک خود را ارسال کرده و فایل آن را دریافت کنید"""
    FORMAT_SELECTION = "فرمت مورد نظر برای ارسال را انتخاب کنید"
    SET_CUSTOM_USERNAME_PASSWORD = """برای تغییر نام فایل یا دانلود از لینک های رمزدار لینک را با فرمت زیر ارسال کنید:
URL | filename | username | password"""
    DOWNLOAD_START = "در حال دانلود..."
    UPLOAD_START = "در حال آپلود..."
    RCHD_TG_API_LIMIT = "امکان آپلود فایل های بیشتر از 2 گیگ وجود ندارد"
    AFTER_SUCCESSFUL_UPLOAD_MSG = "Join @King_network7"
    AFTER_SUCCESSFUL_UPLOAD_MSG_WITH_TS = "دانلود در {} ثانیه.\nآپلود در {} ثانیه."
    SAVED_CUSTOM_THUMB_NAIL = "تامبنیل شما تنظیم شد"
    DEL_ETED_CUSTOM_THUMB_NAIL = "تامبنیل شما با موفقیت حذف شد"
    CUSTOM_CAPTION_UL_FILE = "{}"
    NO_VOID_FORMAT_FOUND = "لینک مورد نظر قابلیت دانلود ندارد"
    ABOUT_MSG = """..."""
    HELP_USER = """..."""
    REPLY_TO_MEDIA_ALBUM_TO_GEN_THUMB = "برای تنظیم تامبنیل دستور /generatecustomthumbnail را ارسال کنید"
    ERR_ONLY_TWO_MEDIA_IN_ALBUM = """فرمت تامبنیل ارسالی باید JPG , PNG باشد"""
    CANCEL_STR = "عملیات لغو شد"
    ZIP_UPLOADED_STR = "آپلود شده {} در {} ثانیه"
    SLOW_URL_DECED = "سرعت لینک مورد نظر بسیار پایین است و توسط ربات قابل دانلود نیست"
